Revit 2027 API
TabbedDialogAction Delegate
 Delegate for tabbed dialog actions, such as OnOK, OnCancel and RestoreDefaults.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public delegate void TabbedDialogAction()
Public Delegate Sub TabbedDialogAction
public delegate void TabbedDialogAction()
type TabbedDialogAction =
    delegate of unit -> unit
See Also
Reference
Autodesk.Revit.UI Namespace